'use strict'
module.exports = {
    "国士無双十三面待ち": {
        "name": "kokushi13",
        "yakuman": 2,
        "menzenOnly": true,
        "coexist": ["天和", "地和", "人和"]
    },
    "国士無双": {
        "name": "kokushi",
        "yakuman": 1,
        "menzenOnly": true,
        "coexist": ["天和", "地和", "人和"]
    },
    "純正九蓮宝燈": {
        "name": "jyun9ren",
        "yakuman": 2,
        "menzenOnly": true,
        "coexist": ["天和", "地和", "人和"]
    },
    "九蓮宝燈": {
        "name": "9ren",
        "yakuman": 1,
        "menzenOnly": true,
        "coexist": ["天和", "地和", "人和"]
    },
    "四暗刻単騎待ち": {
        "name": "4ankotanki",
        "yakuman": 2,
        "menzenOnly": true,
        "coexist": [
            "天和", "地和", "人和", "大四喜", "小四喜", "大三元", "字一色", "緑一色", "清老頭", "四槓子"
        ]
    },
    "四暗刻": {
        "name": "4anko",
        "yakuman": 1,
        "menzenOnly": true,
        "coexist": [
            "天和", "地和", "大四喜", "小四喜", "大三元", "字一色", "緑一色", "清老頭", "四槓子"
        ]
    },
    "大四喜": {
        "name": "dai4shi",
        "yakuman": 2,
        "coexist": ["天和", "地和", "人和", "四暗刻単騎待ち", "四暗刻", "字一色", "四槓子"]
    },
    "小四喜": {
        "name": "syo4shi",
        "yakuman": 1,
        "coexist": ["天和", "地和", "人和", "四暗刻単騎待ち", "四暗刻", "字一色", "四槓子"]
    },
    "大三元": {
        "name": "dai3gen",
        "yakuman": 1,
        "coexist": ["天和", "地和", "人和", "四暗刻単騎待ち", "四暗刻", "字一色", "四槓子"]
    },
    "字一色": {
        "name": "tsu1so",
        "yakuman": 1,
        "coexist": ["天和", "地和", "人和", "四暗刻単騎待ち", "四暗刻", "大四喜", "小四喜", "大三元", "四槓子"]
    },
    "緑一色": {
        "name": "ryu1so",
        "yakuman": 1,
        "coexist": ["天和", "地和", "人和", "四暗刻単騎待ち", "四暗刻", "四槓子"]
    },
    "清老頭": {
        "name": "chinroto",
        "yakuman": 1,
        "coexist": ["天和", "地和", "人和", "四暗刻単騎待ち", "四暗刻", "四槓子"]
    },
    "四槓子": {
        "name": "4kantsu",
        "yakuman": 1,
        "coexist": ["四暗刻単騎待ち", "四暗刻", "大四喜", "小四喜", "大三元", "字一色", "緑一色", "清老頭"]
    },
    "天和": {
        "name": "tenho",
        "yakuman": 1,
        "menzenOnly": true,
        "coexist": [
            "国士無双十三面待ち", "国士無双", "純正九蓮宝燈", "九蓮宝燈", "四暗刻単騎待ち", "四暗刻", "大四喜", "小四喜", "大三元", "字一色", "緑一色", "清老頭"
        ]
    },
    "地和": {
        "name": "chiho",
        "yakuman": 1,
        "menzenOnly": true,
        "coexist": [
            "国士無双十三面待ち", "国士無双", "純正九蓮宝燈", "九蓮宝燈", "四暗刻単騎待ち", "四暗刻", "大四喜", "小四喜", "大三元", "字一色", "緑一色", "清老頭"
        ]
    },
    "人和": {
        "name": "renho",
        "yakuman": 1,
        "menzenOnly": true,
        "coexist": [
            "国士無双十三面待ち", "国士無双", "純正九蓮宝燈", "九蓮宝燈", "四暗刻単騎待ち", "大四喜", "小四喜", "大三元", "字一色", "緑一色", "清老頭"
        ]
    },
    "七対子": {
        "name": "7toi",
        "han": 2,
        "menzenOnly": true,
        "coexist": [
            "清一色", "混一色", "混老頭", "断么九", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "清一色": {
        "name": "chin1tsu",
        "han": 5,
        "menzen+1": true,
        "coexist": [
            "純全帯么九", "対々和", "三暗刻", "三槓子", "一気通貫", "断么九", "平和", "二盃口", "一盃口", "七対子", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "混一色": {
        "name": "hon1tsu",
        "han": 2,
        "menzen+1": true,
        "coexist": [
            "対々和", "混全帯么九", "三暗刻", "三槓子", "混老頭", "小三元", "一気通貫", "役牌", "平和", "二盃口", "一盃口", "七対子", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "三色同刻": {
        "name": "3doko",
        "han": 2,
        "coexist": [
            "対々和", "三暗刻", "三槓子", "混老頭", "役牌", "断么九", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "二盃口": {
        "name": "2peko",
        "han": 3,
        "menzenOnly": true,
        "coexist": [
            "清一色", "混一色", "純全帯么九", "混全帯么九", "断么九", "平和", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "対々和": {
        "name": "toitoi",
        "han": 2,
        "coexist": [
            "清一色", "混一色", "三暗刻", "三槓子", "混老頭", "小三元", "三色同刻", "断么九", "役牌", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "純全帯么九": {
        "name": "jyunchan",
        "han": 2,
        "menzen+1": true,
        "coexist": [
            "清一色", "三色同順", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "混全帯么九": {
        "name": "honchan",
        "han": 1,
        "menzen+1": true,
        "coexist": [
            "混一色", "三色同順", "役牌", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "一気通貫": {
        "name": "1tsu",
        "han": 1,
        "menzen+1": true,
        "coexist": [
            "清一色", "混一色", "役牌", "平和", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "三色同順": {
        "name": "3syoku",
        "han": 1,
        "menzen+1": true,
        "coexist": [
            "純全帯么九", "混全帯么九", "役牌", "平和", "断么九", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "三暗刻": {
        "name": "3anko",
        "han": 2,
        "coexist": [
            "清一色", "混一色", "対々和", "三槓子", "混老頭", "小三元", "三色同刻", "断么九", "役牌", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "三槓子": {
        "name": "3kantsu",
        "han": 2,
        "coexist": [
            "清一色", "混一色", "対々和", "三暗刻", "混老頭", "小三元", "三色同刻", "断么九", "役牌", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "混老頭": {
        "name": "honroto",
        "han": 2,
        "coexist": [
            "混一色", "対々和", "三暗刻", "三槓子", "小三元", "三色同刻", "役牌", "七対子", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "小三元": {
        "name": "syo3gen",
        "han": 2,
        "coexist": [
            "混一色", "対々和", "三暗刻", "三槓子", "混老頭", "一盃口", "役牌", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "役牌": {
        "name": "yakuhai",
        "han": 1,
        "coexist": [
            "混一色", "三色同刻", "混全帯么九", "一気通貫", "小三元", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "断么九": {
        "name": "tanyao",
        "han": 1,
        "coexist": [
            "清一色", "純全帯么九", "三色同刻", "対々和", "三暗刻", "三槓子", "三色同順", "平和", "二盃口", "一盃口", "七対子", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "平和": {
        "name": "pinfu",
        "han": 1,
        "menzenOnly": true,
        "coexist": [
            "清一色", "混一色", "純全帯么九", "混一色", "三色同順", "一気通貫", "断么九", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "一盃口": {
        "name": "1peko",
        "han": 1,
        "menzenOnly": true,
        "coexist": [
            "清一色", "混一色", "純全帯么九", "混全帯么九", "小三元", "断么九", "平和", "一気通貫", "三色同順", "役牌", "ダブル立直", "立直", "一発", "嶺上開花", "海底摸月", "搶槓", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "ダブル立直": {
        "name": "wriichi",
        "han": 2,
        "menzenOnly": true,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "一発", "嶺上開花", "搶槓", "海底摸月", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "立直": {
        "name": "riichi",
        "han": 1,
        "menzenOnly": true,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "一発", "嶺上開花", "搶槓", "海底摸月", "河底撈魚", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "一発": {
        "name": "1patsu",
        "han": 1,
        "menzenOnly": true,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "搶槓", "海底摸月", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "嶺上開花": {
        "name": "rinsyan",
        "han": 1,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "搶槓": {
        "name": "chankan",
        "han": 1,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "ドラ", "赤ドラ"
        ]
    },
    "海底摸月": {
        "name": "haitei",
        "han": 1,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "ドラ", "赤ドラ", "門前清自摸和"
        ]
    },
    "河底撈魚": {
        "name": "hotei",
        "han": 1,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "ドラ", "赤ドラ"
        ]
    },
    "ドラ": {
        "name": "dora",
        "han": 1,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "搶槓", "海底摸月", "河底撈魚", "赤ドラ", "門前清自摸和"
        ]
    },
    "赤ドラ": {
        "name": "aka",
        "han": 1,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "嶺上開花", "搶槓", "海底摸月", "河底撈魚", "ドラ", "門前清自摸和"
        ]
    },
    "門前清自摸和": {
        "name": "tsumo",
        "han": 1,
        "menzenOnly": true,
        "coexist": [
            "七対子", "清一色", "混一色", "三色同刻", "純全帯么九", "混全帯么九", "一気通貫", "三色同順", "対々和", "三暗刻", "三槓子", "混老頭", "小三元", "役牌", "断么九", "平和", "二盃口", "一盃口", "ダブル立直", "立直", "一発", "海底摸月", "ドラ", "赤ドラ"
        ]
    }
}
